landang907-ship-it/xiaozhi/Desktop/ESP32 Wroom/xiaozhi_like/sdkconfig.defaults
# ESP32-S3-WROOM-1 (N16R8: 4MB flash, 2MB Octal PSRAM)
# === Target ===
CONFIG_IDF_TARGET="esp32s3"

# === Flash ===
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# === Partition table (custom 4MB) ===
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions/v2/4m.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# === Console (UART0 on GPIO43/44 -> COM6 USB-UART bridge) ===
# IMPORTANT: COM6 is a USB-UART bridge (CP2102/CH340), NOT native USB.
# Native USB (GPIO19/20) goes to a different port that we are not connected to.
# Same setting as test_mic_project / test_speaker_project which DO print on COM6.
# Must DISABLE all other console options for UART to take effect.
CONFIG_ESP_CONSOLE_UART=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_USB_CDC=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
CONFIG_ESP_CONSOLE_UART_CUSTOM=n
CONFIG_ESP_CONSOLE_NONE=n
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# === PSRAM (2MB Octal) ===
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# === WiFi ===
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# === ESP OTA (P4.1) ===
CONFIG_ESP_OTA_OPTI_RAW_BUILD=y
CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK=n
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=n
CONFIG_BOOTLOADER_FACTORY_RESET_ON_BOOT_FAILURE=n
CONFIG_BOOTLOADER_WDT_ENABLE=y
CONFIG_BOOTLOADER_WDT_TIME_MS=30000

# === FreeRTOS ===
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# === Wake word: DISABLED (use GPIO47 button instead) ===
# (custom kconfig, no IDF symbol -- handled in board code)

# === Board type ===
# (custom kconfig, no IDF symbol -- handled in board code)

# === Audio ===
# (custom kconfig, no IDF symbol -- handled in audio_codec.cc)

# === WebSocket (for xiaozhi protocol) ===
CONFIG_ESP_TLS_USING_MBEDTLS=y
